In [4]:
import pandas as pd
import numpy as np

In [5]:
country = pd.read_csv('country.csv')
country.head()
country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country           6 non-null      object
 1   Continent         6 non-null      object
 2   SurfaceArea       6 non-null      int64
 3   Population        6 non-null      int64
 4   Density           6 non-null      int64
 5   IndependenceDate  6 non-null      object
 6   OfficialLanguage  6 non-null      object
 7   Percentage        6 non-null      float64
dtypes: float64(1), int64(3), object(4)
memory usage: 516.0+ bytes

In [6]:
country

,Country,Continent,SurfaceArea,Population,Density,IndependenceDate,OfficialLanguage,Percentage
0,China,Asia,9572900,1277558000,133,1949-10-01,Mandarin,0.81
1,Bangladesh,Asia,143998,129155000,897,1905-05-24,Bengali,0.98
2,Brazil,South America,8547403,170115000,20,1822-09-07,Portuguese,0.98
3,India,Asia,3287263,1013662000,308,1905-04-30,Hindi,0.40
4,Norway,Europe,385207,5379000,14,1905-05-17,Norwegian,0.97
5,United States,North America,9363520,278357000,30,1776-07-04,English,0.86

In [8]:
country = pd.read_csv('country_subset.csv')

In [8]:
country

               Name Continent  Population
0       Afghanistan      Asia    22720000
1           Albania    Europe     3401200
2           Algeria    Africa    31471000
3    American Samoa   Oceania       68000
4           Andorra    Europe       78000
..              ...       ...         ...
234  Western Sahara    Africa      293000
235           Yemen      Asia    18112000
236      Yugoslavia    Europe    10640000
237          Zambia    Africa     9169000
238        Zimbabwe    Africa    11669000

[239 rows x 3 columns]

In [9]:
country.shape

(239, 3)

In [10]:
country.info()
country.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 239 entries, 0 to 238
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        239 non-null    object
 1   Continent   239 non-null    object
 2   Population  239 non-null    int64
dtypes: int64(1), object(2)
memory usage: 5.7+ KB

         Population
count  2.390000e+02
mean   2.543410e+07
std    1.093398e+08
min    0.000000e+00
25%    2.380000e+05
50%    3.869000e+06
75%    1.493550e+07
max    1.277558e+09

In [3]:
country.dtypes

NameError: name 'country' is not defined

In [22]:
totals = country.groupby('Continent')['Population'].sum()
print(totals)

largest_continent = totals.idxmax()
largest_total = totals.max()
print(largest_continent, largest_total)

Continent
Africa            784475000
Antarctica                0
Asia             3705025700
Europe            730074600
North America     482993000
Oceania            30401150
South America     345780000
Name: Population, dtype: int64
Asia 3705025700

In [9]:
country

               Name Continent  Population
0       Afghanistan      Asia    22720000
1           Albania    Europe     3401200
2           Algeria    Africa    31471000
3    American Samoa   Oceania       68000
4           Andorra    Europe       78000
..              ...       ...         ...
234  Western Sahara    Africa      293000
235           Yemen      Asia    18112000
236      Yugoslavia    Europe    10640000
237          Zambia    Africa     9169000
238        Zimbabwe    Africa    11669000

[239 rows x 3 columns]

In [17]:
populus = country[['Name','Population']].sort_values(by='Population', ascending=False).head(6)
populus

              Name  Population
44           China  1277558000
99           India  1013662000
224  United States   278357000
100      Indonesia   212107000
29          Brazil   170115000
161       Pakistan   156483000

In [40]:
populus = country[country['Population'] > 100_000_000][['Name','Continent','Population']].sort_values('Population', ascending=False).head(10)
populus

                   Name      Continent  Population
44                China           Asia  1277558000
99                India           Asia  1013662000
224       United States  North America   278357000
100           Indonesia           Asia   212107000
29               Brazil  South America   170115000
161            Pakistan           Asia   156483000
176  Russian Federation         Europe   146934000
17           Bangladesh           Asia   129155000
107               Japan           Asia   126714000
154             Nigeria         Africa   111506000

SyntaxError: unmatched ')' (3834038964.py, line 2)